Catalogs/СтатьиДоходовИРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>СтатьиДоходовИРасходов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяВУчетеДоходов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяВУчетеРасходов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СтатьиДоходовИРасходов/Ext/ManagerModule.bsl
Процедура ЗаполнитьИспользованиеСтатейВУчетеДоходовИРасходовПоУмолчанию() Экспорт
	
	//выполнять в любом случае
	//Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьВедениеУчетаДоходовРасходов") Тогда
	//	Возврат;
	//КонецЕсли;
	
	Выборка = Справочники.СтатьиДоходовИРасходов.Выбрать();	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Предопределенный Тогда
			
			СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
			
			СпрОбъект.ИспользуетсяВУчетеДоходов  = Ложь;
			СпрОбъект.ИспользуетсяВУчетеРасходов = Ложь;
			
			Если Выборка.ИмяПредопределенныхДанных = "Продажи"			
				ИЛИ Выборка.ИмяПредопределенныхДанных = "ВозвратПоставщику"  
				ИЛИ Выборка.ИмяПредопределенныхДанных = "ПрочиеДоходы" 
				ИЛИ Выборка.ИмяПредопределенныхДанных = "ОприходованиеТоваров"
				ИЛИ Выборка.ИмяПредопределенныхДанных = "ВозвратДСОтПоставщика"
				Тогда
				
				СпрОбъект.ИспользуетсяВУчетеДоходов = Истина;
			Иначе
				СпрОбъект.ИспользуетсяВУчетеРасходов = Истина;				
			КонецЕсли;
			
			Попытка
				СпрОбъект.Записать();
			Исключение
			КонецПопытки;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
